{
  "device": "macos",
  "steps": [
    {
      "title": "Passphrases",
      "main": {
        "text": [
          "Is your computer locked with a long, random passphrase?"
        ],
        "buttons": {
          "yes": "Yes",
          "no": "No"
        }
      },
      "back": {
        "text": [
          "The passphrase on your computer must be long, random and unique. Use a passphrase generator to get a truly random passphrase, not just one you think is hard to guess. GummyBear3272, for instance, is not random. This is extra important for your computer passphrase, since an attacker has unlimited tries to guess.",
          "You’ll also want random, unique passphrases for every service you use online. Use a passphrase manager like KeePass or LastPass to generate, keep and organize your passphrases. <a href=\"https://ssd.eff.org/en/playlist/want-security-starter-pack#creating-strong-passwords\" target=\"_blank\">Read more here</a>."
        ],
        "buttons": {
          "next": "Done",
          "later": "Later"
        }
      }
    },
    {
      "title": "VPN",
      "main": {
        "text": [
          "Do you use a VPN (Virtual Private Network)? It secures your internet connection to guarantee that the data you're sending and receiving is encrypted and secured from prying eyes."
        ],
        "buttons": {
          "yes": "Yes",
          "no": "Not Yet"
        }
      },
      "back": {
        "text": [
          "A VPN (Virtual Private Network) encrypts your web traffic, making it very difficult for your Internet Service Provider, the NSA, or some creep on Starbucks WiFi to monitor your internet activity. Most VPNs charge a small fee, but it’s well worth the cost if you spend a lot of time working away from home, or on torrent sites.",
          "<a href=\"http://www.getavpn.org/\" target=\"_blank\">Get a VPN.</a>",
          "This VPN subscription can be used on up to 5 devices, including your phone and computer."
        ],
        "buttons": {
          "next": "Done",
          "later": "Later"
        }
      }
    },
    {
      "title": "Two-Factor Auth (2FA)",
      "bgTitle": "2FA",
      "main": {
        "text": [
          "Do you use two factor authentication, a super-secure two-step sign-in process, for everything you can, especially email, social media accounts, and utilities?"
        ],
        "buttons": {
          "yes": "Yes",
          "no": "Not Yet"
        }
      },
      "back": {
        "text": [
          "Find out what services offer two factor auth <a href=\"https://twofactorauth.org\" target=\"_blank\">here</a>."
        ],
        "buttons": {
          "next": "Done",
          "later": "Later"
        }
      }
    },
    {
      "title": "Encryption",
      "main": {
        "text": [
          "Encrypting your hard drive protects you from hackers, but also protects your info if your device is lost or stolen.",
          "Have you turned on FileVault?"
        ],
        "buttons": {
          "yes": "Yes",
          "no": "Not Yet"
        }
      },
      "back": {
        "text": [
          "Encryption protects you from surveillance, but also protects your private information if your device is lost or stolen.",
          "Learn more about encryption <a href=\"https://ssd.eff.org/en/playlist/want-security-starter-pack#keeping-your-data-safe\" target=\"_blank\">here</a>."
        ],
        "buttons": {
          "next": "Done",
          "later": "Later"
        }
      }
    },
    {
      "title": "Antivirus",
      "main": {
        "text": [
          "Running a regular antivirus scan keeps your computer running smoothly and lets you know if you’ve accidently downloaded any malware, or if your system has otherwise been compromised.",
          "Do you use antivirus software?"
        ],
        "buttons": {
          "yes": "Yes",
          "no": "Not Yet"
        }
      },
      "back": {
        "text": [
          "Apple users often believe they don’t need antivirus software because the operating system protects them, but that’s not necessarily true. Bad actors and government agents are always searching for and finding vulnerabilities, so it’s still a good idea to use antivirus software.",
          "There are many different anti-virus programs you can use. Here are some suggestions for <a href=\"http://www.digitaltrends.com/computing/best-free-antivirus-software-for-mac/\" target=\"_blank\">free antivirus software</a>."
        ],
        "buttons": {
          "next": "Done",
          "later": "Later"
        }
      }
    },
    {
      "title": "Updates",
      "main": {
        "text": [
          "Updates regularly include security patches for newly discovered vulnerabilities.",
          "Is your system up to date?"
        ],
        "buttons": {
          "yes": "Yes",
          "no": "Not Yet"
        }
      },
      "back": {
        "text": [
          "It can seem annoying, but it’s so important to update your operating system consistently. Updates can contain new security features or patches.",
          "<a href=\"https://support.apple.com/en-us/HT201541\" target=\"_blank\">Learn how to update your Mac</a>"
        ],
        "buttons": {
          "next": "Done",
          "later": "Later"
        }
      }
    }
  ]
}
